/********************************************************************************************************************
 * 主菜单
 ********************************************************************************************************************/
#include "zf_common_headfile.h"

#include "Debug_Page.h"
#include "Menu.h"


// 菜单选项 标志位
uint8_t Mode_Flag = IDLE_MODE;
//-------------------------------------------------------------------------------------------------------------------
// 函数简介     外设初始化
// 使用示例     Peripheral_Init();
// 备注信息     只在"main.c"中调用一次
//-------------------------------------------------------------------------------------------------------------------
void Peripheral_Init(void)
{
    // IPS200 初始化
    ips200_init("/dev/fb0");
    ips200_clear();
//    ips200_full(RGB565_BLACK);

    // 电机初始化调用
    Motor_Init();

    // IMU 初始化
    imu_get_dev_info(); 

    // 雷达初始化
    if (!ld_usart_init("/dev/ttyUSB1", 230400))
    {
        printf("failed:USB1初始化失败");
    }

    // uwb初始化
    uwb_usart_init(UWB_UART_DEVICE, UWB_UART_BAUDRATE);

    // 两板通信初始化
    if (uart1_init("/dev/ttyS1", 115200))
    {   
        printf("failed:uart1串口初始化失败\n");
    }
}

/*******************************************************************************************************************/
/*[S] 菜单样式 [S]--------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// [一级界面]主菜单界面
void Menu_UI(uint8_t Page)
{
	switch(Page)
	{		
		// 第一页
		case 1:
		{
            ips200_show_string(8  ,0  , "[Menu]");
            ips200_show_string(0  ,16 , "==============================");
            ips200_show_string(10 ,32 , "Debug");
            ips200_show_string(10 ,48 , "Avoid");

			break;
		}
	}
}

// [二级界面]避障模式界面
void Avoid_UI(void)
{
    ips200_show_string(8  ,0  , "[Avoid]");
    ips200_show_string(0  ,16 , "==============================");
    ips200_show_string(0  ,32 , "State:#####");
}
/*******************************************************************************************************************/
/*--------------------------------------------------------------------------------------------------[E] 菜单样式 [E]*/
/*******************************************************************************************************************/


/*******************************************************************************************************************/
/*[S] 交互界面 [S]--------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/

// 菜单选项 标志位
uint8_t menu_flag = 1;

// 提前声明函数
int Avoid_Mode(void);

void Menu_Show(void)
{
    ips200_clear();
    Menu_UI(1);
    ips200_show_string(0  ,32 , ">");

    while(1)
    {
        // 存储确认键被按下时menuflag的值的临时变量，默认为无效值0
		uint8_t menu_flag_temp = 0;
		// 上/下按键是否被按下过
		uint8_t key_pressed = 0;

        /* 按键处理*/
        if (Key_Check(KEY_NAME_UP,KEY_SINGLE))
        {
            key_pressed = 1;
            menu_flag --;
            if (menu_flag < 1)menu_flag = 2;
        }
        else if (Key_Check(KEY_NAME_DOWN,KEY_SINGLE))
        {
            key_pressed = 1;
            menu_flag ++;
            if (menu_flag > 2)menu_flag = 1;
        }
        else if (Key_Check(KEY_NAME_CONFIRM,KEY_SINGLE))
        {
            menu_flag_temp = menu_flag;
        }
        // else if (Key_Check(KEY_NAME_BACK,KEY_SINGLE))
        // {
        // // 返回上一级界面
        // return 0;   
        // }


        /* 模式跳转*/
        // Debug模式界面
        if (menu_flag_temp == 1)
        {
            ips200_clear();
            Debug_Page_Menu();

            // 从Debug界面返回，显示主菜单界面
            ips200_clear();
            Menu_UI(1);
            ips200_show_string(0  ,32 , ">");
        }
        if (menu_flag_temp == 2)
        {
            ips200_clear();
            Avoid_Mode();

            // 从Avoid界面返回，显示主菜单界面
            ips200_clear();
            Menu_UI(1);
            ips200_show_string(0  ,48 , ">");
        }


        /* 显示更新*/
        if (key_pressed)
        {
            switch (menu_flag)
            {
                // 在"Debug模式"的光标
                case 1:
                    ips200_clear();
                    Menu_UI(1);
                    ips200_show_string(0  ,32 , ">");
                    break;

                // 在"Avoid模式"的光标
                case 2:
                    ips200_clear();
                    Menu_UI(1);
                    ips200_show_string(0  ,48 , ">");
                    break;
            }
        }
    }
}
/*******************************************************************************************************************/
/*--------------------------------------------------------------------------------------------------[E] 交互界面 [E]*/
/*******************************************************************************************************************/


/*******************************************************************************************************************/
/*[S] 避障模式 [S]--------------------------------------------------------------------------------------------------*/
/*******************************************************************************************************************/
int Avoid_Mode(void)
{
    Avoid_UI();

    Mode_Flag = AVOID_MODE;

    while(1)
    {
        /* 按键处理*/
        if (Key_Check(KEY_NAME_BACK,KEY_SINGLE))
        {   
            // 停车
            Motor_Reset_ALL();

            Mode_Flag = IDLE_MODE;

            // 停车
            Motor_Reset_ALL();
            // 返回上一级界面
            return 0;   
        }
    }
}
/*******************************************************************************************************************/
/*--------------------------------------------------------------------------------------------------[E] 避障模式 [E]*/
/*******************************************************************************************************************/